{"keras_version": "2.2.4", "class_name": "Model", "config": {"name": "model_1", "layers": [{"name": "input_1", "class_name": "InputLayer", "config": {"name": "input_1", "sparse": false, "batch_input_shape": [null, 100], "dtype": "float32"}, "inbound_nodes": []}, {"name": "dense_2", "class_name": "Dense", "config": {"name": "dense_2", "kernel_constraint": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 1024, "trainable": true, "kernel_regularizer": null, "activation": "relu", "bias_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "bias_constraint": null}, "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"name": "dense_3", "class_name": "Dense", "config": {"name": "dense_3", "kernel_constraint": null, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 8192, "trainable": true, "kernel_regularizer": null, "activation": "relu", "bias_regularizer": null, "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "bias_constraint": null}, "inbound_nodes": [[["dense_2", 0, 0, {}]]]}, {"name": "reshape_1", "class_name": "Reshape", "config": {"target_shape": [8, 8, 128], "name": "reshape_1", "trainable": true}, "inbound_nodes": [[["dense_3", 0, 0, {}]]]}, {"name": "batch_normalization_1", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_1", "gamma_regularizer": null, "beta_regularizer": null, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "beta_constraint": null, "axis": -1, "center": true}, "inbound_nodes": [[["reshape_1", 0, 0, {"training": false}]]]}, {"name": "leaky_re_lu_1", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_1", "trainable": true, "alpha": 0.10000000149011612}, "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]]}, {"name": "conv2d_transpose_1", "class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_1", "kernel_constraint": null, "data_format": "channels_last", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "filters": 256, "strides": [2, 2], "trainable": true, "kernel_size": [2, 2], "dilation_rate": [1, 1], "activation": "linear", "output_padding": null, "kernel_regularizer": null, "use_bias": false, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "bias_constraint": null}, "inbound_nodes": [[["leaky_re_lu_1", 0, 0, {}]]]}, {"name": "batch_normalization_2", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_2", "gamma_regularizer": null, "beta_regularizer": null, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "beta_constraint": null, "axis": -1, "center": true}, "inbound_nodes": [[["conv2d_transpose_1", 0, 0, {"training": false}]]]}, {"name": "leaky_re_lu_2", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_2", "trainable": true, "alpha": 0.10000000149011612}, "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]]}, {"name": "block_4", "class_name": "Conv2D", "config": {"name": "block_4", "kernel_constraint": null, "data_format": "channels_last", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "filters": 128, "strides": [1, 1], "trainable": true, "kernel_size": [1, 1], "dilation_rate": [1, 1], "activation": "relu", "kernel_regularizer": null, "use_bias": true, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "bias_constraint": null}, "inbound_nodes": [[["leaky_re_lu_2", 0, 0, {}]]]}, {"name": "conv2d_transpose_2", "class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_2", "kernel_constraint": null, "data_format": "channels_last", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "filters": 128, "strides": [2, 2], "trainable": true, "kernel_size": [2, 2], "dilation_rate": [1, 1], "activation": "linear", "output_padding": null, "kernel_regularizer": null, "use_bias": false, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "bias_constraint": null}, "inbound_nodes": [[["block_4", 0, 0, {}]]]}, {"name": "batch_normalization_3", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_3", "gamma_regularizer": null, "beta_regularizer": null, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "beta_constraint": null, "axis": -1, "center": true}, "inbound_nodes": [[["conv2d_transpose_2", 0, 0, {"training": false}]]]}, {"name": "leaky_re_lu_3", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_3", "trainable": true, "alpha": 0.10000000149011612}, "inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]]}, {"name": "block_5", "class_name": "Conv2D", "config": {"name": "block_5", "kernel_constraint": null, "data_format": "channels_last", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "filters": 64, "strides": [1, 1], "trainable": true, "kernel_size": [1, 1], "dilation_rate": [1, 1], "activation": "relu", "kernel_regularizer": null, "use_bias": true, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "bias_constraint": null}, "inbound_nodes": [[["leaky_re_lu_3", 0, 0, {}]]]}, {"name": "conv2d_transpose_3", "class_name": "Conv2DTranspose", "config": {"name": "conv2d_transpose_3", "kernel_constraint": null, "data_format": "channels_last", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "valid", "filters": 64, "strides": [2, 2], "trainable": true, "kernel_size": [2, 2], "dilation_rate": [1, 1], "activation": "linear", "output_padding": null, "kernel_regularizer": null, "use_bias": false, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "bias_constraint": null}, "inbound_nodes": [[["block_5", 0, 0, {}]]]}, {"name": "batch_normalization_4", "class_name": "BatchNormalization", "config": {"name": "batch_normalization_4", "gamma_regularizer": null, "beta_regularizer": null, "epsilon": 0.001, "beta_initializer": {"class_name": "Zeros", "config": {}}, "momentum": 0.99, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_initializer": {"class_name": "Ones", "config": {}}, "scale": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "beta_constraint": null, "axis": -1, "center": true}, "inbound_nodes": [[["conv2d_transpose_3", 0, 0, {"training": false}]]]}, {"name": "leaky_re_lu_4", "class_name": "LeakyReLU", "config": {"name": "leaky_re_lu_4", "trainable": true, "alpha": 0.10000000149011612}, "inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]]}, {"name": "block_6", "class_name": "Conv2D", "config": {"name": "block_6", "kernel_constraint": null, "data_format": "channels_last", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "filters": 32, "strides": [1, 1], "trainable": true, "kernel_size": [1, 1], "dilation_rate": [1, 1], "activation": "relu", "kernel_regularizer": null, "use_bias": true, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "bias_constraint": null}, "inbound_nodes": [[["leaky_re_lu_4", 0, 0, {}]]]}, {"name": "final_block", "class_name": "Conv2D", "config": {"name": "final_block", "kernel_constraint": null, "data_format": "channels_last", "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "padding": "same", "filters": 3, "strides": [1, 1], "trainable": true, "kernel_size": [1, 1], "dilation_rate": [1, 1], "activation": "sigmoid", "kernel_regularizer": null, "use_bias": true, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "distribution": "uniform", "mode": "fan_avg", "seed": null}}, "bias_constraint": null}, "inbound_nodes": [[["block_6", 0, 0, {}]]]}], "input_layers": [["input_1", 0, 0]], "output_layers": [["final_block", 0, 0]]}, "backend": "tensorflow"}