{"keras_version": "2.2.4", "config": {"name": "model_2", "input_layers": [["input_2", 0, 0]], "output_layers": [["dense_5", 0, 0]], "layers": [{"name": "input_2", "config": {"name": "input_2", "sparse": false, "batch_input_shape": [null, 64, 64, 3], "dtype": "float32"}, "inbound_nodes": [], "class_name": "InputLayer"}, {"name": "block1_conv1", "config": {"name": "block1_conv1", "kernel_size": [3, 3], "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "kernel_constraint": null, "use_bias": true, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "filters": 32, "dilation_rate": [1, 1], "activation": "relu", "padding": "same", "data_format": "channels_last", "trainable": true, "kernel_regularizer": null, "bias_constraint": null, "activity_regularizer": null}, "inbound_nodes": [[["input_2", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "block1_conv2", "config": {"name": "block1_conv2", "kernel_size": [3, 3], "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "kernel_constraint": null, "use_bias": true, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "filters": 32, "dilation_rate": [1, 1], "activation": "relu", "padding": "same", "data_format": "channels_last", "trainable": true, "kernel_regularizer": null, "bias_constraint": null, "activity_regularizer": null}, "inbound_nodes": [[["block1_conv1", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "block1_pool", "config": {"name": "block1_pool", "pool_size": [2, 2], "strides": [2, 2], "trainable": true, "data_format": "channels_last", "padding": "valid"}, "inbound_nodes": [[["block1_conv2", 0, 0, {}]]], "class_name": "MaxPooling2D"}, {"name": "block2_conv1", "config": {"name": "block2_conv1", "kernel_size": [3, 3], "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "kernel_constraint": null, "use_bias": true, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "filters": 64, "dilation_rate": [1, 1], "activation": "relu", "padding": "same", "data_format": "channels_last", "trainable": true, "kernel_regularizer": null, "bias_constraint": null, "activity_regularizer": null}, "inbound_nodes": [[["block1_pool", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "block2_conv2", "config": {"name": "block2_conv2", "kernel_size": [3, 3], "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "kernel_constraint": null, "use_bias": true, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "filters": 64, "dilation_rate": [1, 1], "activation": "relu", "padding": "same", "data_format": "channels_last", "trainable": true, "kernel_regularizer": null, "bias_constraint": null, "activity_regularizer": null}, "inbound_nodes": [[["block2_conv1", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "block2_pool", "config": {"name": "block2_pool", "pool_size": [2, 2], "strides": [2, 2], "trainable": true, "data_format": "channels_last", "padding": "valid"}, "inbound_nodes": [[["block2_conv2", 0, 0, {}]]], "class_name": "MaxPooling2D"}, {"name": "block4_conv1", "config": {"name": "block4_conv1", "kernel_size": [3, 3], "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "kernel_constraint": null, "use_bias": true, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "filters": 128, "dilation_rate": [1, 1], "activation": "relu", "padding": "same", "data_format": "channels_last", "trainable": true, "kernel_regularizer": null, "bias_constraint": null, "activity_regularizer": null}, "inbound_nodes": [[["block2_pool", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "block4_conv2", "config": {"name": "block4_conv2", "kernel_size": [3, 3], "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "kernel_constraint": null, "use_bias": true, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "filters": 128, "dilation_rate": [1, 1], "activation": "relu", "padding": "same", "data_format": "channels_last", "trainable": true, "kernel_regularizer": null, "bias_constraint": null, "activity_regularizer": null}, "inbound_nodes": [[["block4_conv1", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "block4_pool", "config": {"name": "block4_pool", "pool_size": [2, 2], "strides": [2, 2], "trainable": true, "data_format": "channels_last", "padding": "valid"}, "inbound_nodes": [[["block4_conv2", 0, 0, {}]]], "class_name": "MaxPooling2D"}, {"name": "block5_pool", "config": {"name": "block5_pool", "pool_size": [2, 2], "strides": [1, 1], "trainable": true, "data_format": "channels_last", "padding": "valid"}, "inbound_nodes": [[["block4_pool", 0, 0, {}]]], "class_name": "MaxPooling2D"}, {"name": "flatten_1", "config": {"name": "flatten_1", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["block5_pool", 0, 0, {}]]], "class_name": "Flatten"}, {"name": "dense_4", "config": {"name": "dense_4", "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 1024, "use_bias": true, "kernel_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_constraint": null, "activity_regularizer": null}, "inbound_nodes": [[["flatten_1", 0, 0, {}]]], "class_name": "Dense"}, {"name": "dense_5", "config": {"name": "dense_5", "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 1, "use_bias": true, "kernel_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "activation": "sigmoid", "trainable": true, "kernel_regularizer": null, "bias_constraint": null, "activity_regularizer": null}, "inbound_nodes": [[["dense_4", 0, 0, {}]]], "class_name": "Dense"}]}, "backend": "tensorflow", "class_name": "Model"}