{"backend": "tensorflow", "class_name": "Model", "keras_version": "2.2.4", "config": {"output_layers": [["dense_5", 0, 0]], "input_layers": [["input_2", 0, 0]], "name": "model_2", "layers": [{"inbound_nodes": [], "class_name": "InputLayer", "name": "input_2", "config": {"name": "input_2", "sparse": false, "batch_input_shape": [null, 64, 64, 3], "dtype": "float32"}}, {"inbound_nodes": [[["input_2", 0, 0, {}]]], "class_name": "Conv2D", "name": "block1_conv1", "config": {"data_format": "channels_last", "name": "block1_conv1", "padding": "same", "use_bias": true, "filters": 32, "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "kernel_size": [3, 3], "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "bias_constraint": null, "kernel_constraint": null, "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "bias_regularizer": null}}, {"inbound_nodes": [[["block1_conv1", 0, 0, {}]]], "class_name": "Conv2D", "name": "block1_conv2", "config": {"data_format": "channels_last", "name": "block1_conv2", "padding": "same", "use_bias": true, "filters": 32, "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "kernel_size": [3, 3], "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "bias_constraint": null, "kernel_constraint": null, "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "bias_regularizer": null}}, {"inbound_nodes": [[["block1_conv2", 0, 0, {}]]], "class_name": "MaxPooling2D", "name": "block1_pool", "config": {"strides": [2, 2], "name": "block1_pool", "padding": "valid", "data_format": "channels_last", "trainable": true, "pool_size": [2, 2]}}, {"inbound_nodes": [[["block1_pool", 0, 0, {}]]], "class_name": "Conv2D", "name": "block2_conv1", "config": {"data_format": "channels_last", "name": "block2_conv1", "padding": "same", "use_bias": true, "filters": 64, "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "kernel_size": [3, 3], "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "bias_constraint": null, "kernel_constraint": null, "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "bias_regularizer": null}}, {"inbound_nodes": [[["block2_conv1", 0, 0, {}]]], "class_name": "Conv2D", "name": "block2_conv2", "config": {"data_format": "channels_last", "name": "block2_conv2", "padding": "same", "use_bias": true, "filters": 64, "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "kernel_size": [3, 3], "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "bias_constraint": null, "kernel_constraint": null, "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "bias_regularizer": null}}, {"inbound_nodes": [[["block2_conv2", 0, 0, {}]]], "class_name": "MaxPooling2D", "name": "block2_pool", "config": {"strides": [2, 2], "name": "block2_pool", "padding": "valid", "data_format": "channels_last", "trainable": true, "pool_size": [2, 2]}}, {"inbound_nodes": [[["block2_pool", 0, 0, {}]]], "class_name": "Conv2D", "name": "block4_conv1", "config": {"data_format": "channels_last", "name": "block4_conv1", "padding": "same", "use_bias": true, "filters": 128, "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "kernel_size": [3, 3], "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "bias_constraint": null, "kernel_constraint": null, "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "bias_regularizer": null}}, {"inbound_nodes": [[["block4_conv1", 0, 0, {}]]], "class_name": "Conv2D", "name": "block4_conv2", "config": {"data_format": "channels_last", "name": "block4_conv2", "padding": "same", "use_bias": true, "filters": 128, "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "kernel_size": [3, 3], "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "bias_constraint": null, "kernel_constraint": null, "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "bias_regularizer": null}}, {"inbound_nodes": [[["block4_conv2", 0, 0, {}]]], "class_name": "MaxPooling2D", "name": "block4_pool", "config": {"strides": [2, 2], "name": "block4_pool", "padding": "valid", "data_format": "channels_last", "trainable": true, "pool_size": [2, 2]}}, {"inbound_nodes": [[["block4_pool", 0, 0, {}]]], "class_name": "MaxPooling2D", "name": "block5_pool", "config": {"strides": [1, 1], "name": "block5_pool", "padding": "valid", "data_format": "channels_last", "trainable": true, "pool_size": [2, 2]}}, {"inbound_nodes": [[["block5_pool", 0, 0, {}]]], "class_name": "Flatten", "name": "flatten_1", "config": {"data_format": "channels_last", "trainable": true, "name": "flatten_1"}}, {"inbound_nodes": [[["flatten_1", 0, 0, {}]]], "class_name": "Dense", "name": "dense_4", "config": {"name": "dense_4", "bias_regularizer": null, "use_bias": true, "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "bias_constraint": null, "units": 1024, "kernel_regularizer": null, "kernel_constraint": null}}, {"inbound_nodes": [[["dense_4", 0, 0, {}]]], "class_name": "Dense", "name": "dense_5", "config": {"name": "dense_5", "bias_regularizer": null, "use_bias": true, "activation": "sigmoid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "bias_constraint": null, "units": 1, "kernel_regularizer": null, "kernel_constraint": null}}]}}