{"keras_version": "2.2.4", "config": {"name": "model_1", "input_layers": [["input_1", 0, 0]], "output_layers": [["final_block", 0, 0]], "layers": [{"name": "input_1", "config": {"name": "input_1", "sparse": false, "batch_input_shape": [null, 100], "dtype": "float32"}, "inbound_nodes": [], "class_name": "InputLayer"}, {"name": "dense_2", "config": {"name": "dense_2", "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 1024, "use_bias": true, "kernel_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_constraint": null, "activity_regularizer": null}, "inbound_nodes": [[["input_1", 0, 0, {}]]], "class_name": "Dense"}, {"name": "dense_3", "config": {"name": "dense_3", "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "units": 8192, "use_bias": true, "kernel_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "activation": "relu", "trainable": true, "kernel_regularizer": null, "bias_constraint": null, "activity_regularizer": null}, "inbound_nodes": [[["dense_2", 0, 0, {}]]], "class_name": "Dense"}, {"name": "reshape_1", "config": {"name": "reshape_1", "trainable": true, "target_shape": [8, 8, 128]}, "inbound_nodes": [[["dense_3", 0, 0, {}]]], "class_name": "Reshape"}, {"name": "batch_normalization_1", "config": {"name": "batch_normalization_1", "beta_constraint": null, "gamma_regularizer": null, "scale": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "axis": -1, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "epsilon": 0.001, "trainable": true, "beta_regularizer": null}, "inbound_nodes": [[["reshape_1", 0, 0, {"training": false}]]], "class_name": "BatchNormalization"}, {"name": "leaky_re_lu_1", "config": {"name": "leaky_re_lu_1", "trainable": true, "alpha": 0.10000000149011612}, "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]], "class_name": "LeakyReLU"}, {"name": "conv2d_transpose_1", "config": {"name": "conv2d_transpose_1", "kernel_size": [2, 2], "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [2, 2], "kernel_constraint": null, "use_bias": false, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "filters": 256, "dilation_rate": [1, 1], "activation": "linear", "padding": "valid", "data_format": "channels_last", "trainable": true, "kernel_regularizer": null, "bias_constraint": null, "output_padding": null, "activity_regularizer": null}, "inbound_nodes": [[["leaky_re_lu_1", 0, 0, {}]]], "class_name": "Conv2DTranspose"}, {"name": "batch_normalization_2", "config": {"name": "batch_normalization_2", "beta_constraint": null, "gamma_regularizer": null, "scale": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "axis": -1, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "epsilon": 0.001, "trainable": true, "beta_regularizer": null}, "inbound_nodes": [[["conv2d_transpose_1", 0, 0, {"training": false}]]], "class_name": "BatchNormalization"}, {"name": "leaky_re_lu_2", "config": {"name": "leaky_re_lu_2", "trainable": true, "alpha": 0.10000000149011612}, "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]], "class_name": "LeakyReLU"}, {"name": "block_4", "config": {"name": "block_4", "kernel_size": [1, 1], "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "kernel_constraint": null, "use_bias": true, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "filters": 128, "dilation_rate": [1, 1], "activation": "relu", "padding": "same", "data_format": "channels_last", "trainable": true, "kernel_regularizer": null, "bias_constraint": null, "activity_regularizer": null}, "inbound_nodes": [[["leaky_re_lu_2", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "conv2d_transpose_2", "config": {"name": "conv2d_transpose_2", "kernel_size": [2, 2], "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [2, 2], "kernel_constraint": null, "use_bias": false, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "filters": 128, "dilation_rate": [1, 1], "activation": "linear", "padding": "valid", "data_format": "channels_last", "trainable": true, "kernel_regularizer": null, "bias_constraint": null, "output_padding": null, "activity_regularizer": null}, "inbound_nodes": [[["block_4", 0, 0, {}]]], "class_name": "Conv2DTranspose"}, {"name": "batch_normalization_3", "config": {"name": "batch_normalization_3", "beta_constraint": null, "gamma_regularizer": null, "scale": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "axis": -1, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "epsilon": 0.001, "trainable": true, "beta_regularizer": null}, "inbound_nodes": [[["conv2d_transpose_2", 0, 0, {"training": false}]]], "class_name": "BatchNormalization"}, {"name": "leaky_re_lu_3", "config": {"name": "leaky_re_lu_3", "trainable": true, "alpha": 0.10000000149011612}, "inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]], "class_name": "LeakyReLU"}, {"name": "block_5", "config": {"name": "block_5", "kernel_size": [1, 1], "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "kernel_constraint": null, "use_bias": true, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "filters": 64, "dilation_rate": [1, 1], "activation": "relu", "padding": "same", "data_format": "channels_last", "trainable": true, "kernel_regularizer": null, "bias_constraint": null, "activity_regularizer": null}, "inbound_nodes": [[["leaky_re_lu_3", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "conv2d_transpose_3", "config": {"name": "conv2d_transpose_3", "kernel_size": [2, 2], "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [2, 2], "kernel_constraint": null, "use_bias": false, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "filters": 64, "dilation_rate": [1, 1], "activation": "linear", "padding": "valid", "data_format": "channels_last", "trainable": true, "kernel_regularizer": null, "bias_constraint": null, "output_padding": null, "activity_regularizer": null}, "inbound_nodes": [[["block_5", 0, 0, {}]]], "class_name": "Conv2DTranspose"}, {"name": "batch_normalization_4", "config": {"name": "batch_normalization_4", "beta_constraint": null, "gamma_regularizer": null, "scale": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "axis": -1, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_constraint": null, "epsilon": 0.001, "trainable": true, "beta_regularizer": null}, "inbound_nodes": [[["conv2d_transpose_3", 0, 0, {"training": false}]]], "class_name": "BatchNormalization"}, {"name": "leaky_re_lu_4", "config": {"name": "leaky_re_lu_4", "trainable": true, "alpha": 0.10000000149011612}, "inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]], "class_name": "LeakyReLU"}, {"name": "block_6", "config": {"name": "block_6", "kernel_size": [1, 1], "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "kernel_constraint": null, "use_bias": true, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "filters": 32, "dilation_rate": [1, 1], "activation": "relu", "padding": "same", "data_format": "channels_last", "trainable": true, "kernel_regularizer": null, "bias_constraint": null, "activity_regularizer": null}, "inbound_nodes": [[["leaky_re_lu_4", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "final_block", "config": {"name": "final_block", "kernel_size": [1, 1], "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "strides": [1, 1], "kernel_constraint": null, "use_bias": true, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}, "class_name": "VarianceScaling"}, "filters": 3, "dilation_rate": [1, 1], "activation": "sigmoid", "padding": "same", "data_format": "channels_last", "trainable": true, "kernel_regularizer": null, "bias_constraint": null, "activity_regularizer": null}, "inbound_nodes": [[["block_6", 0, 0, {}]]], "class_name": "Conv2D"}]}, "backend": "tensorflow", "class_name": "Model"}