{"backend": "tensorflow", "class_name": "Model", "keras_version": "2.2.4", "config": {"output_layers": [["final_block", 0, 0]], "input_layers": [["input_1", 0, 0]], "name": "model_1", "layers": [{"inbound_nodes": [], "class_name": "InputLayer", "name": "input_1", "config": {"name": "input_1", "sparse": false, "batch_input_shape": [null, 100], "dtype": "float32"}}, {"inbound_nodes": [[["input_1", 0, 0, {}]]], "class_name": "Dense", "name": "dense_2", "config": {"name": "dense_2", "bias_regularizer": null, "use_bias": true, "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "bias_constraint": null, "units": 1024, "kernel_regularizer": null, "kernel_constraint": null}}, {"inbound_nodes": [[["dense_2", 0, 0, {}]]], "class_name": "Dense", "name": "dense_3", "config": {"name": "dense_3", "bias_regularizer": null, "use_bias": true, "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "bias_constraint": null, "units": 8192, "kernel_regularizer": null, "kernel_constraint": null}}, {"inbound_nodes": [[["dense_3", 0, 0, {}]]], "class_name": "Reshape", "name": "reshape_1", "config": {"trainable": true, "name": "reshape_1", "target_shape": [8, 8, 128]}}, {"inbound_nodes": [[["reshape_1", 0, 0, {"training": false}]]], "class_name": "BatchNormalization", "name": "batch_normalization_1", "config": {"gamma_regularizer": null, "name": "batch_normalization_1", "beta_constraint": null, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "beta_regularizer": null, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "trainable": true, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]], "class_name": "LeakyReLU", "name": "leaky_re_lu_1", "config": {"trainable": true, "name": "leaky_re_lu_1", "alpha": 0.10000000149011612}}, {"inbound_nodes": [[["leaky_re_lu_1", 0, 0, {}]]], "class_name": "Conv2DTranspose", "name": "conv2d_transpose_1", "config": {"data_format": "channels_last", "name": "conv2d_transpose_1", "padding": "valid", "use_bias": false, "output_padding": null, "dilation_rate": [1, 1], "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "kernel_size": [2, 2], "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "bias_constraint": null, "kernel_constraint": null, "strides": [2, 2], "filters": 256, "kernel_regularizer": null, "bias_regularizer": null}}, {"inbound_nodes": [[["conv2d_transpose_1", 0, 0, {"training": false}]]], "class_name": "BatchNormalization", "name": "batch_normalization_2", "config": {"gamma_regularizer": null, "name": "batch_normalization_2", "beta_constraint": null, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "beta_regularizer": null, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "trainable": true, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]], "class_name": "LeakyReLU", "name": "leaky_re_lu_2", "config": {"trainable": true, "name": "leaky_re_lu_2", "alpha": 0.10000000149011612}}, {"inbound_nodes": [[["leaky_re_lu_2", 0, 0, {}]]], "class_name": "Conv2D", "name": "block_4", "config": {"data_format": "channels_last", "name": "block_4", "padding": "same", "use_bias": true, "filters": 128, "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "kernel_size": [1, 1], "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "bias_constraint": null, "kernel_constraint": null, "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "bias_regularizer": null}}, {"inbound_nodes": [[["block_4", 0, 0, {}]]], "class_name": "Conv2DTranspose", "name": "conv2d_transpose_2", "config": {"data_format": "channels_last", "name": "conv2d_transpose_2", "padding": "valid", "use_bias": false, "output_padding": null, "dilation_rate": [1, 1], "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "kernel_size": [2, 2], "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "bias_constraint": null, "kernel_constraint": null, "strides": [2, 2], "filters": 128, "kernel_regularizer": null, "bias_regularizer": null}}, {"inbound_nodes": [[["conv2d_transpose_2", 0, 0, {"training": false}]]], "class_name": "BatchNormalization", "name": "batch_normalization_3", "config": {"gamma_regularizer": null, "name": "batch_normalization_3", "beta_constraint": null, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "beta_regularizer": null, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "trainable": true, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]], "class_name": "LeakyReLU", "name": "leaky_re_lu_3", "config": {"trainable": true, "name": "leaky_re_lu_3", "alpha": 0.10000000149011612}}, {"inbound_nodes": [[["leaky_re_lu_3", 0, 0, {}]]], "class_name": "Conv2D", "name": "block_5", "config": {"data_format": "channels_last", "name": "block_5", "padding": "same", "use_bias": true, "filters": 64, "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "kernel_size": [1, 1], "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "bias_constraint": null, "kernel_constraint": null, "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "bias_regularizer": null}}, {"inbound_nodes": [[["block_5", 0, 0, {}]]], "class_name": "Conv2DTranspose", "name": "conv2d_transpose_3", "config": {"data_format": "channels_last", "name": "conv2d_transpose_3", "padding": "valid", "use_bias": false, "output_padding": null, "dilation_rate": [1, 1], "activation": "linear", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "kernel_size": [2, 2], "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "bias_constraint": null, "kernel_constraint": null, "strides": [2, 2], "filters": 64, "kernel_regularizer": null, "bias_regularizer": null}}, {"inbound_nodes": [[["conv2d_transpose_3", 0, 0, {"training": false}]]], "class_name": "BatchNormalization", "name": "batch_normalization_4", "config": {"gamma_regularizer": null, "name": "batch_normalization_4", "beta_constraint": null, "center": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "beta_regularizer": null, "gamma_constraint": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "epsilon": 0.001, "trainable": true, "momentum": 0.99, "beta_initializer": {"class_name": "Zeros", "config": {}}, "axis": -1, "moving_variance_initializer": {"class_name": "Ones", "config": {}}}}, {"inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]], "class_name": "LeakyReLU", "name": "leaky_re_lu_4", "config": {"trainable": true, "name": "leaky_re_lu_4", "alpha": 0.10000000149011612}}, {"inbound_nodes": [[["leaky_re_lu_4", 0, 0, {}]]], "class_name": "Conv2D", "name": "block_6", "config": {"data_format": "channels_last", "name": "block_6", "padding": "same", "use_bias": true, "filters": 32, "activation": "relu", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "kernel_size": [1, 1], "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "bias_constraint": null, "kernel_constraint": null, "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "bias_regularizer": null}}, {"inbound_nodes": [[["block_6", 0, 0, {}]]], "class_name": "Conv2D", "name": "final_block", "config": {"data_format": "channels_last", "name": "final_block", "padding": "same", "use_bias": true, "filters": 3, "activation": "sigmoid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"distribution": "uniform", "seed": null, "scale": 1.0, "mode": "fan_avg"}}, "kernel_size": [1, 1], "activity_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "trainable": true, "bias_constraint": null, "kernel_constraint": null, "strides": [1, 1], "dilation_rate": [1, 1], "kernel_regularizer": null, "bias_regularizer": null}}]}}