{"backend": "tensorflow", "class_name": "Model", "keras_version": "2.2.4", "config": {"output_layers": [["final_block", 0, 0]], "layers": [{"class_name": "InputLayer", "name": "input_1", "inbound_nodes": [], "config": {"sparse": false, "name": "input_1", "batch_input_shape": [null, 100], "dtype": "float32"}}, {"class_name": "Dense", "name": "dense_2", "inbound_nodes": [[["input_1", 0, 0, {}]]], "config": {"units": 1024, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "trainable": true, "bias_constraint": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "activity_regularizer": null, "activation": "relu", "name": "dense_2", "use_bias": true}}, {"class_name": "Dense", "name": "dense_3", "inbound_nodes": [[["dense_2", 0, 0, {}]]], "config": {"units": 8192, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "trainable": true, "bias_constraint": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "activity_regularizer": null, "activation": "relu", "name": "dense_3", "use_bias": true}}, {"class_name": "Reshape", "name": "reshape_1", "inbound_nodes": [[["dense_3", 0, 0, {}]]], "config": {"target_shape": [8, 8, 128], "name": "reshape_1", "trainable": true}}, {"class_name": "BatchNormalization", "name": "batch_normalization_1", "inbound_nodes": [[["reshape_1", 0, 0, {"training": false}]]], "config": {"beta_constraint": null, "momentum": 0.99, "name": "batch_normalization_1", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "axis": -1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "epsilon": 0.001}}, {"class_name": "LeakyReLU", "name": "leaky_re_lu_1", "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]], "config": {"name": "leaky_re_lu_1", "alpha": 0.10000000149011612, "trainable": true}}, {"class_name": "Conv2DTranspose", "name": "conv2d_transpose_1", "inbound_nodes": [[["leaky_re_lu_1", 0, 0, {}]]], "config": {"bias_regularizer": null, "kernel_size": [2, 2], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 256, "activity_regularizer": null, "padding": "valid", "trainable": true, "use_bias": false, "data_format": "channels_last", "bias_constraint": null, "strides": [2, 2], "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_regularizer": null, "activation": "linear", "name": "conv2d_transpose_1", "output_padding": null}}, {"class_name": "BatchNormalization", "name": "batch_normalization_2", "inbound_nodes": [[["conv2d_transpose_1", 0, 0, {"training": false}]]], "config": {"beta_constraint": null, "momentum": 0.99, "name": "batch_normalization_2", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "axis": -1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "epsilon": 0.001}}, {"class_name": "LeakyReLU", "name": "leaky_re_lu_2", "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]], "config": {"name": "leaky_re_lu_2", "alpha": 0.10000000149011612, "trainable": true}}, {"class_name": "Conv2D", "name": "block_4", "inbound_nodes": [[["leaky_re_lu_2", 0, 0, {}]]], "config": {"bias_regularizer": null, "kernel_size": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 128, "activity_regularizer": null, "padding": "same", "trainable": true, "data_format": "channels_last", "bias_constraint": null, "strides": [1, 1], "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_regularizer": null, "activation": "relu", "name": "block_4", "use_bias": true}}, {"class_name": "Conv2DTranspose", "name": "conv2d_transpose_2", "inbound_nodes": [[["block_4", 0, 0, {}]]], "config": {"bias_regularizer": null, "kernel_size": [2, 2], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 128, "activity_regularizer": null, "padding": "valid", "trainable": true, "use_bias": false, "data_format": "channels_last", "bias_constraint": null, "strides": [2, 2], "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_regularizer": null, "activation": "linear", "name": "conv2d_transpose_2", "output_padding": null}}, {"class_name": "BatchNormalization", "name": "batch_normalization_3", "inbound_nodes": [[["conv2d_transpose_2", 0, 0, {"training": false}]]], "config": {"beta_constraint": null, "momentum": 0.99, "name": "batch_normalization_3", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "axis": -1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "epsilon": 0.001}}, {"class_name": "LeakyReLU", "name": "leaky_re_lu_3", "inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]], "config": {"name": "leaky_re_lu_3", "alpha": 0.10000000149011612, "trainable": true}}, {"class_name": "Conv2D", "name": "block_5", "inbound_nodes": [[["leaky_re_lu_3", 0, 0, {}]]], "config": {"bias_regularizer": null, "kernel_size": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 64, "activity_regularizer": null, "padding": "same", "trainable": true, "data_format": "channels_last", "bias_constraint": null, "strides": [1, 1], "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_regularizer": null, "activation": "relu", "name": "block_5", "use_bias": true}}, {"class_name": "Conv2DTranspose", "name": "conv2d_transpose_3", "inbound_nodes": [[["block_5", 0, 0, {}]]], "config": {"bias_regularizer": null, "kernel_size": [2, 2], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 64, "activity_regularizer": null, "padding": "valid", "trainable": true, "use_bias": false, "data_format": "channels_last", "bias_constraint": null, "strides": [2, 2], "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_regularizer": null, "activation": "linear", "name": "conv2d_transpose_3", "output_padding": null}}, {"class_name": "BatchNormalization", "name": "batch_normalization_4", "inbound_nodes": [[["conv2d_transpose_3", 0, 0, {"training": false}]]], "config": {"beta_constraint": null, "momentum": 0.99, "name": "batch_normalization_4", "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "trainable": true, "gamma_regularizer": null, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "scale": true, "beta_regularizer": null, "gamma_initializer": {"class_name": "Ones", "config": {}}, "gamma_constraint": null, "axis": -1, "beta_initializer": {"class_name": "Zeros", "config": {}}, "center": true, "epsilon": 0.001}}, {"class_name": "LeakyReLU", "name": "leaky_re_lu_4", "inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]], "config": {"name": "leaky_re_lu_4", "alpha": 0.10000000149011612, "trainable": true}}, {"class_name": "Conv2D", "name": "block_6", "inbound_nodes": [[["leaky_re_lu_4", 0, 0, {}]]], "config": {"bias_regularizer": null, "kernel_size": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 32, "activity_regularizer": null, "padding": "same", "trainable": true, "data_format": "channels_last", "bias_constraint": null, "strides": [1, 1], "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_regularizer": null, "activation": "relu", "name": "block_6", "use_bias": true}}, {"class_name": "Conv2D", "name": "final_block", "inbound_nodes": [[["block_6", 0, 0, {}]]], "config": {"bias_regularizer": null, "kernel_size": [1, 1], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 3, "activity_regularizer": null, "padding": "same", "trainable": true, "data_format": "channels_last", "bias_constraint": null, "strides": [1, 1], "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_regularizer": null, "activation": "sigmoid", "name": "final_block", "use_bias": true}}], "input_layers": [["input_1", 0, 0]], "name": "model_1"}}