{"keras_version": "2.2.4", "config": {"layers": [{"name": "input_1", "config": {"dtype": "float32", "sparse": false, "batch_input_shape": [null, 100], "name": "input_1"}, "inbound_nodes": [], "class_name": "InputLayer"}, {"name": "dense_2", "config": {"kernel_constraint": null, "activation": "relu", "kernel_regularizer": null, "name": "dense_2", "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "units": 1024, "bias_constraint": null, "trainable": true, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activity_regularizer": null}, "inbound_nodes": [[["input_1", 0, 0, {}]]], "class_name": "Dense"}, {"name": "dense_3", "config": {"kernel_constraint": null, "activation": "relu", "kernel_regularizer": null, "name": "dense_3", "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "units": 8192, "bias_constraint": null, "trainable": true, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activity_regularizer": null}, "inbound_nodes": [[["dense_2", 0, 0, {}]]], "class_name": "Dense"}, {"name": "reshape_1", "config": {"name": "reshape_1", "trainable": true, "target_shape": [8, 8, 128]}, "inbound_nodes": [[["dense_3", 0, 0, {}]]], "class_name": "Reshape"}, {"name": "batch_normalization_1", "config": {"gamma_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "axis": -1, "momentum": 0.99, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "beta_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "beta_regularizer": null, "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "name": "batch_normalization_1", "epsilon": 0.001}, "inbound_nodes": [[["reshape_1", 0, 0, {"training": false}]]], "class_name": "BatchNormalization"}, {"name": "leaky_re_lu_1", "config": {"name": "leaky_re_lu_1", "trainable": true, "alpha": 0.10000000149011612}, "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]], "class_name": "LeakyReLU"}, {"name": "conv2d_transpose_1", "config": {"bias_constraint": null, "kernel_constraint": null, "activation": "linear", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "name": "conv2d_transpose_1", "bias_regularizer": null, "kernel_size": [2, 2], "data_format": "channels_last", "strides": [2, 2], "use_bias": false, "activity_regularizer": null, "filters": 256, "padding": "valid", "dilation_rate": [1, 1], "output_padding": null, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "trainable": true}, "inbound_nodes": [[["leaky_re_lu_1", 0, 0, {}]]], "class_name": "Conv2DTranspose"}, {"name": "batch_normalization_2", "config": {"gamma_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "axis": -1, "momentum": 0.99, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "beta_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "beta_regularizer": null, "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "name": "batch_normalization_2", "epsilon": 0.001}, "inbound_nodes": [[["conv2d_transpose_1", 0, 0, {"training": false}]]], "class_name": "BatchNormalization"}, {"name": "leaky_re_lu_2", "config": {"name": "leaky_re_lu_2", "trainable": true, "alpha": 0.10000000149011612}, "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]], "class_name": "LeakyReLU"}, {"name": "block_4", "config": {"bias_constraint": null, "kernel_constraint": null, "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "name": "block_4", "bias_regularizer": null, "kernel_size": [1, 1], "data_format": "channels_last", "strides": [1, 1], "use_bias": true, "activity_regularizer": null, "filters": 128, "padding": "same", "dilation_rate": [1, 1], "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "trainable": true}, "inbound_nodes": [[["leaky_re_lu_2", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "conv2d_transpose_2", "config": {"bias_constraint": null, "kernel_constraint": null, "activation": "linear", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "name": "conv2d_transpose_2", "bias_regularizer": null, "kernel_size": [2, 2], "data_format": "channels_last", "strides": [2, 2], "use_bias": false, "activity_regularizer": null, "filters": 128, "padding": "valid", "dilation_rate": [1, 1], "output_padding": null, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "trainable": true}, "inbound_nodes": [[["block_4", 0, 0, {}]]], "class_name": "Conv2DTranspose"}, {"name": "batch_normalization_3", "config": {"gamma_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "axis": -1, "momentum": 0.99, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "beta_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "beta_regularizer": null, "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "name": "batch_normalization_3", "epsilon": 0.001}, "inbound_nodes": [[["conv2d_transpose_2", 0, 0, {"training": false}]]], "class_name": "BatchNormalization"}, {"name": "leaky_re_lu_3", "config": {"name": "leaky_re_lu_3", "trainable": true, "alpha": 0.10000000149011612}, "inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]], "class_name": "LeakyReLU"}, {"name": "block_5", "config": {"bias_constraint": null, "kernel_constraint": null, "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "name": "block_5", "bias_regularizer": null, "kernel_size": [1, 1], "data_format": "channels_last", "strides": [1, 1], "use_bias": true, "activity_regularizer": null, "filters": 64, "padding": "same", "dilation_rate": [1, 1], "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "trainable": true}, "inbound_nodes": [[["leaky_re_lu_3", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "conv2d_transpose_3", "config": {"bias_constraint": null, "kernel_constraint": null, "activation": "linear", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "name": "conv2d_transpose_3", "bias_regularizer": null, "kernel_size": [2, 2], "data_format": "channels_last", "strides": [2, 2], "use_bias": false, "activity_regularizer": null, "filters": 64, "padding": "valid", "dilation_rate": [1, 1], "output_padding": null, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "trainable": true}, "inbound_nodes": [[["block_5", 0, 0, {}]]], "class_name": "Conv2DTranspose"}, {"name": "batch_normalization_4", "config": {"gamma_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "center": true, "axis": -1, "momentum": 0.99, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "scale": true, "beta_constraint": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "beta_regularizer": null, "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "name": "batch_normalization_4", "epsilon": 0.001}, "inbound_nodes": [[["conv2d_transpose_3", 0, 0, {"training": false}]]], "class_name": "BatchNormalization"}, {"name": "leaky_re_lu_4", "config": {"name": "leaky_re_lu_4", "trainable": true, "alpha": 0.10000000149011612}, "inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]], "class_name": "LeakyReLU"}, {"name": "block_6", "config": {"bias_constraint": null, "kernel_constraint": null, "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "name": "block_6", "bias_regularizer": null, "kernel_size": [1, 1], "data_format": "channels_last", "strides": [1, 1], "use_bias": true, "activity_regularizer": null, "filters": 32, "padding": "same", "dilation_rate": [1, 1], "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "trainable": true}, "inbound_nodes": [[["leaky_re_lu_4", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "final_block", "config": {"bias_constraint": null, "kernel_constraint": null, "activation": "sigmoid", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "name": "final_block", "bias_regularizer": null, "kernel_size": [1, 1], "data_format": "channels_last", "strides": [1, 1], "use_bias": true, "activity_regularizer": null, "filters": 3, "padding": "same", "dilation_rate": [1, 1], "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "trainable": true}, "inbound_nodes": [[["block_6", 0, 0, {}]]], "class_name": "Conv2D"}], "name": "model_1", "output_layers": [["final_block", 0, 0]], "input_layers": [["input_1", 0, 0]]}, "backend": "tensorflow", "class_name": "Model"}