{"config": {"input_layers": [["input_1", 0, 0]], "output_layers": [["final_block", 0, 0]], "name": "model_1", "layers": [{"config": {"sparse": false, "batch_input_shape": [null, 100], "name": "input_1", "dtype": "float32"}, "class_name": "InputLayer", "name": "input_1", "inbound_nodes": []}, {"config": {"activity_regularizer": null, "name": "dense_2", "trainable": true, "activation": "relu", "kernel_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "use_bias": true, "bias_regularizer": null, "units": 1024, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense", "name": "dense_2", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"config": {"activity_regularizer": null, "name": "dense_3", "trainable": true, "activation": "relu", "kernel_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "use_bias": true, "bias_regularizer": null, "units": 8192, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense", "name": "dense_3", "inbound_nodes": [[["dense_2", 0, 0, {}]]]}, {"config": {"target_shape": [8, 8, 128], "name": "reshape_1", "trainable": true}, "class_name": "Reshape", "name": "reshape_1", "inbound_nodes": [[["dense_3", 0, 0, {}]]]}, {"config": {"moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "beta_constraint": null, "center": true, "name": "batch_normalization_1", "trainable": true, "gamma_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "scale": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "axis": -1}, "class_name": "BatchNormalization", "name": "batch_normalization_1", "inbound_nodes": [[["reshape_1", 0, 0, {"training": false}]]]}, {"config": {"alpha": 0.10000000149011612, "name": "leaky_re_lu_1", "trainable": true}, "class_name": "LeakyReLU", "name": "leaky_re_lu_1", "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]]}, {"config": {"strides": [2, 2], "bias_regularizer": null, "activity_regularizer": null, "name": "conv2d_transpose_1", "activation": "linear", "kernel_size": [2, 2], "trainable": true, "kernel_constraint": null, "padding": "valid", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "use_bias": false, "dilation_rate": [1, 1], "filters": 256, "kernel_regularizer": null, "data_format": "channels_last", "output_padding": null}, "class_name": "Conv2DTranspose", "name": "conv2d_transpose_1", "inbound_nodes": [[["leaky_re_lu_1", 0, 0, {}]]]}, {"config": {"moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "beta_constraint": null, "center": true, "name": "batch_normalization_2", "trainable": true, "gamma_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "scale": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "axis": -1}, "class_name": "BatchNormalization", "name": "batch_normalization_2", "inbound_nodes": [[["conv2d_transpose_1", 0, 0, {"training": false}]]]}, {"config": {"alpha": 0.10000000149011612, "name": "leaky_re_lu_2", "trainable": true}, "class_name": "LeakyReLU", "name": "leaky_re_lu_2", "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]]}, {"config": {"strides": [1, 1], "bias_regularizer": null, "activity_regularizer": null, "name": "block_4", "activation": "relu", "kernel_size": [1, 1], "trainable": true, "kernel_constraint": null, "padding": "same", "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "use_bias": true, "dilation_rate": [1, 1], "filters": 128, "kernel_regularizer": null, "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv2D", "name": "block_4", "inbound_nodes": [[["leaky_re_lu_2", 0, 0, {}]]]}, {"config": {"strides": [2, 2], "bias_regularizer": null, "activity_regularizer": null, "name": "conv2d_transpose_2", "activation": "linear", "kernel_size": [2, 2], "trainable": true, "kernel_constraint": null, "padding": "valid", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "use_bias": false, "dilation_rate": [1, 1], "filters": 128, "kernel_regularizer": null, "data_format": "channels_last", "output_padding": null}, "class_name": "Conv2DTranspose", "name": "conv2d_transpose_2", "inbound_nodes": [[["block_4", 0, 0, {}]]]}, {"config": {"moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "beta_constraint": null, "center": true, "name": "batch_normalization_3", "trainable": true, "gamma_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "scale": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "axis": -1}, "class_name": "BatchNormalization", "name": "batch_normalization_3", "inbound_nodes": [[["conv2d_transpose_2", 0, 0, {"training": false}]]]}, {"config": {"alpha": 0.10000000149011612, "name": "leaky_re_lu_3", "trainable": true}, "class_name": "LeakyReLU", "name": "leaky_re_lu_3", "inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]]}, {"config": {"strides": [1, 1], "bias_regularizer": null, "activity_regularizer": null, "name": "block_5", "activation": "relu", "kernel_size": [1, 1], "trainable": true, "kernel_constraint": null, "padding": "same", "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "use_bias": true, "dilation_rate": [1, 1], "filters": 64, "kernel_regularizer": null, "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv2D", "name": "block_5", "inbound_nodes": [[["leaky_re_lu_3", 0, 0, {}]]]}, {"config": {"strides": [2, 2], "bias_regularizer": null, "activity_regularizer": null, "name": "conv2d_transpose_3", "activation": "linear", "kernel_size": [2, 2], "trainable": true, "kernel_constraint": null, "padding": "valid", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "use_bias": false, "dilation_rate": [1, 1], "filters": 64, "kernel_regularizer": null, "data_format": "channels_last", "output_padding": null}, "class_name": "Conv2DTranspose", "name": "conv2d_transpose_3", "inbound_nodes": [[["block_5", 0, 0, {}]]]}, {"config": {"moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "gamma_regularizer": null, "beta_constraint": null, "center": true, "name": "batch_normalization_4", "trainable": true, "gamma_constraint": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "momentum": 0.99, "scale": true, "beta_initializer": {"config": {}, "class_name": "Zeros"}, "epsilon": 0.001, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "beta_regularizer": null, "axis": -1}, "class_name": "BatchNormalization", "name": "batch_normalization_4", "inbound_nodes": [[["conv2d_transpose_3", 0, 0, {"training": false}]]]}, {"config": {"alpha": 0.10000000149011612, "name": "leaky_re_lu_4", "trainable": true}, "class_name": "LeakyReLU", "name": "leaky_re_lu_4", "inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]]}, {"config": {"strides": [1, 1], "bias_regularizer": null, "activity_regularizer": null, "name": "block_6", "activation": "relu", "kernel_size": [1, 1], "trainable": true, "kernel_constraint": null, "padding": "same", "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "use_bias": true, "dilation_rate": [1, 1], "filters": 32, "kernel_regularizer": null, "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv2D", "name": "block_6", "inbound_nodes": [[["leaky_re_lu_4", 0, 0, {}]]]}, {"config": {"strides": [1, 1], "bias_regularizer": null, "activity_regularizer": null, "name": "final_block", "activation": "sigmoid", "kernel_size": [1, 1], "trainable": true, "kernel_constraint": null, "padding": "same", "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "use_bias": true, "dilation_rate": [1, 1], "filters": 3, "kernel_regularizer": null, "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv2D", "name": "final_block", "inbound_nodes": [[["block_6", 0, 0, {}]]]}]}, "class_name": "Model", "keras_version": "2.2.4", "backend": "tensorflow"}