{"backend": "tensorflow", "class_name": "Model", "keras_version": "2.2.4", "config": {"output_layers": [["dense_5", 0, 0]], "layers": [{"class_name": "InputLayer", "name": "input_2", "inbound_nodes": [], "config": {"sparse": false, "name": "input_2", "batch_input_shape": [null, 64, 64, 3], "dtype": "float32"}}, {"class_name": "Conv2D", "name": "block1_conv1", "inbound_nodes": [[["input_2", 0, 0, {}]]], "config": {"bias_regularizer": null, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 32, "activity_regularizer": null, "padding": "same", "trainable": true, "data_format": "channels_last", "bias_constraint": null, "strides": [1, 1], "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_regularizer": null, "activation": "relu", "name": "block1_conv1", "use_bias": true}}, {"class_name": "Conv2D", "name": "block1_conv2", "inbound_nodes": [[["block1_conv1", 0, 0, {}]]], "config": {"bias_regularizer": null, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 32, "activity_regularizer": null, "padding": "same", "trainable": true, "data_format": "channels_last", "bias_constraint": null, "strides": [1, 1], "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_regularizer": null, "activation": "relu", "name": "block1_conv2", "use_bias": true}}, {"class_name": "MaxPooling2D", "name": "block1_pool", "inbound_nodes": [[["block1_conv2", 0, 0, {}]]], "config": {"strides": [2, 2], "pool_size": [2, 2], "padding": "valid", "name": "block1_pool", "trainable": true, "data_format": "channels_last"}}, {"class_name": "Conv2D", "name": "block2_conv1", "inbound_nodes": [[["block1_pool", 0, 0, {}]]], "config": {"bias_regularizer": null, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 64, "activity_regularizer": null, "padding": "same", "trainable": true, "data_format": "channels_last", "bias_constraint": null, "strides": [1, 1], "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_regularizer": null, "activation": "relu", "name": "block2_conv1", "use_bias": true}}, {"class_name": "Conv2D", "name": "block2_conv2", "inbound_nodes": [[["block2_conv1", 0, 0, {}]]], "config": {"bias_regularizer": null, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 64, "activity_regularizer": null, "padding": "same", "trainable": true, "data_format": "channels_last", "bias_constraint": null, "strides": [1, 1], "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_regularizer": null, "activation": "relu", "name": "block2_conv2", "use_bias": true}}, {"class_name": "MaxPooling2D", "name": "block2_pool", "inbound_nodes": [[["block2_conv2", 0, 0, {}]]], "config": {"strides": [2, 2], "pool_size": [2, 2], "padding": "valid", "name": "block2_pool", "trainable": true, "data_format": "channels_last"}}, {"class_name": "Conv2D", "name": "block4_conv1", "inbound_nodes": [[["block2_pool", 0, 0, {}]]], "config": {"bias_regularizer": null, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 128, "activity_regularizer": null, "padding": "same", "trainable": true, "data_format": "channels_last", "bias_constraint": null, "strides": [1, 1], "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_regularizer": null, "activation": "relu", "name": "block4_conv1", "use_bias": true}}, {"class_name": "Conv2D", "name": "block4_conv2", "inbound_nodes": [[["block4_conv1", 0, 0, {}]]], "config": {"bias_regularizer": null, "kernel_size": [3, 3], "bias_initializer": {"class_name": "Zeros", "config": {}}, "filters": 128, "activity_regularizer": null, "padding": "same", "trainable": true, "data_format": "channels_last", "bias_constraint": null, "strides": [1, 1], "dilation_rate": [1, 1], "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "kernel_regularizer": null, "activation": "relu", "name": "block4_conv2", "use_bias": true}}, {"class_name": "MaxPooling2D", "name": "block4_pool", "inbound_nodes": [[["block4_conv2", 0, 0, {}]]], "config": {"strides": [2, 2], "pool_size": [2, 2], "padding": "valid", "name": "block4_pool", "trainable": true, "data_format": "channels_last"}}, {"class_name": "MaxPooling2D", "name": "block5_pool", "inbound_nodes": [[["block4_pool", 0, 0, {}]]], "config": {"strides": [1, 1], "pool_size": [2, 2], "padding": "valid", "name": "block5_pool", "trainable": true, "data_format": "channels_last"}}, {"class_name": "Flatten", "name": "flatten_1", "inbound_nodes": [[["block5_pool", 0, 0, {}]]], "config": {"name": "flatten_1", "trainable": true, "data_format": "channels_last"}}, {"class_name": "Dense", "name": "dense_4", "inbound_nodes": [[["flatten_1", 0, 0, {}]]], "config": {"units": 1024, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "trainable": true, "bias_constraint": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "activity_regularizer": null, "activation": "relu", "name": "dense_4", "use_bias": true}}, {"class_name": "Dense", "name": "dense_5", "inbound_nodes": [[["dense_4", 0, 0, {}]]], "config": {"units": 1, "bias_regularizer": null, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "trainable": true, "bias_constraint": null, "kernel_constraint": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "activity_regularizer": null, "activation": "sigmoid", "name": "dense_5", "use_bias": true}}], "input_layers": [["input_2", 0, 0]], "name": "model_2"}}