{"config": {"input_layers": [["input_2", 0, 0]], "output_layers": [["dense_5", 0, 0]], "name": "model_2", "layers": [{"config": {"sparse": false, "batch_input_shape": [null, 64, 64, 3], "name": "input_2", "dtype": "float32"}, "class_name": "InputLayer", "name": "input_2", "inbound_nodes": []}, {"config": {"strides": [1, 1], "bias_regularizer": null, "activity_regularizer": null, "name": "block1_conv1", "activation": "relu", "kernel_size": [3, 3], "trainable": true, "kernel_constraint": null, "padding": "same", "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "use_bias": true, "dilation_rate": [1, 1], "filters": 32, "kernel_regularizer": null, "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv2D", "name": "block1_conv1", "inbound_nodes": [[["input_2", 0, 0, {}]]]}, {"config": {"strides": [1, 1], "bias_regularizer": null, "activity_regularizer": null, "name": "block1_conv2", "activation": "relu", "kernel_size": [3, 3], "trainable": true, "kernel_constraint": null, "padding": "same", "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "use_bias": true, "dilation_rate": [1, 1], "filters": 32, "kernel_regularizer": null, "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv2D", "name": "block1_conv2", "inbound_nodes": [[["block1_conv1", 0, 0, {}]]]}, {"config": {"padding": "valid", "name": "block1_pool", "trainable": true, "strides": [2, 2], "data_format": "channels_last", "pool_size": [2, 2]}, "class_name": "MaxPooling2D", "name": "block1_pool", "inbound_nodes": [[["block1_conv2", 0, 0, {}]]]}, {"config": {"strides": [1, 1], "bias_regularizer": null, "activity_regularizer": null, "name": "block2_conv1", "activation": "relu", "kernel_size": [3, 3], "trainable": true, "kernel_constraint": null, "padding": "same", "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "use_bias": true, "dilation_rate": [1, 1], "filters": 64, "kernel_regularizer": null, "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv2D", "name": "block2_conv1", "inbound_nodes": [[["block1_pool", 0, 0, {}]]]}, {"config": {"strides": [1, 1], "bias_regularizer": null, "activity_regularizer": null, "name": "block2_conv2", "activation": "relu", "kernel_size": [3, 3], "trainable": true, "kernel_constraint": null, "padding": "same", "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "use_bias": true, "dilation_rate": [1, 1], "filters": 64, "kernel_regularizer": null, "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv2D", "name": "block2_conv2", "inbound_nodes": [[["block2_conv1", 0, 0, {}]]]}, {"config": {"padding": "valid", "name": "block2_pool", "trainable": true, "strides": [2, 2], "data_format": "channels_last", "pool_size": [2, 2]}, "class_name": "MaxPooling2D", "name": "block2_pool", "inbound_nodes": [[["block2_conv2", 0, 0, {}]]]}, {"config": {"strides": [1, 1], "bias_regularizer": null, "activity_regularizer": null, "name": "block4_conv1", "activation": "relu", "kernel_size": [3, 3], "trainable": true, "kernel_constraint": null, "padding": "same", "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "use_bias": true, "dilation_rate": [1, 1], "filters": 128, "kernel_regularizer": null, "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv2D", "name": "block4_conv1", "inbound_nodes": [[["block2_pool", 0, 0, {}]]]}, {"config": {"strides": [1, 1], "bias_regularizer": null, "activity_regularizer": null, "name": "block4_conv2", "activation": "relu", "kernel_size": [3, 3], "trainable": true, "kernel_constraint": null, "padding": "same", "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "use_bias": true, "dilation_rate": [1, 1], "filters": 128, "kernel_regularizer": null, "data_format": "channels_last", "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv2D", "name": "block4_conv2", "inbound_nodes": [[["block4_conv1", 0, 0, {}]]]}, {"config": {"padding": "valid", "name": "block4_pool", "trainable": true, "strides": [2, 2], "data_format": "channels_last", "pool_size": [2, 2]}, "class_name": "MaxPooling2D", "name": "block4_pool", "inbound_nodes": [[["block4_conv2", 0, 0, {}]]]}, {"config": {"padding": "valid", "name": "block5_pool", "trainable": true, "strides": [1, 1], "data_format": "channels_last", "pool_size": [2, 2]}, "class_name": "MaxPooling2D", "name": "block5_pool", "inbound_nodes": [[["block4_pool", 0, 0, {}]]]}, {"config": {"name": "flatten_1", "data_format": "channels_last", "trainable": true}, "class_name": "Flatten", "name": "flatten_1", "inbound_nodes": [[["block5_pool", 0, 0, {}]]]}, {"config": {"activity_regularizer": null, "name": "dense_4", "trainable": true, "activation": "relu", "kernel_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "use_bias": true, "bias_regularizer": null, "units": 1024, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense", "name": "dense_4", "inbound_nodes": [[["flatten_1", 0, 0, {}]]]}, {"config": {"activity_regularizer": null, "name": "dense_5", "trainable": true, "activation": "sigmoid", "kernel_regularizer": null, "kernel_constraint": null, "kernel_initializer": {"config": {"scale": 1.0, "mode": "fan_avg", "seed": null, "distribution": "uniform"}, "class_name": "VarianceScaling"}, "bias_constraint": null, "use_bias": true, "bias_regularizer": null, "units": 1, "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Dense", "name": "dense_5", "inbound_nodes": [[["dense_4", 0, 0, {}]]]}]}, "class_name": "Model", "keras_version": "2.2.4", "backend": "tensorflow"}