{"keras_version": "2.2.4", "config": {"layers": [{"name": "input_2", "config": {"dtype": "float32", "sparse": false, "batch_input_shape": [null, 64, 64, 3], "name": "input_2"}, "inbound_nodes": [], "class_name": "InputLayer"}, {"name": "block1_conv1", "config": {"bias_constraint": null, "kernel_constraint": null, "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "name": "block1_conv1", "bias_regularizer": null, "kernel_size": [3, 3], "data_format": "channels_last", "strides": [1, 1], "use_bias": true, "activity_regularizer": null, "filters": 32, "padding": "same", "dilation_rate": [1, 1], "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "trainable": true}, "inbound_nodes": [[["input_2", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "block1_conv2", "config": {"bias_constraint": null, "kernel_constraint": null, "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "name": "block1_conv2", "bias_regularizer": null, "kernel_size": [3, 3], "data_format": "channels_last", "strides": [1, 1], "use_bias": true, "activity_regularizer": null, "filters": 32, "padding": "same", "dilation_rate": [1, 1], "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "trainable": true}, "inbound_nodes": [[["block1_conv1", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "block1_pool", "config": {"name": "block1_pool", "pool_size": [2, 2], "trainable": true, "data_format": "channels_last", "strides": [2, 2], "padding": "valid"}, "inbound_nodes": [[["block1_conv2", 0, 0, {}]]], "class_name": "MaxPooling2D"}, {"name": "block2_conv1", "config": {"bias_constraint": null, "kernel_constraint": null, "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "name": "block2_conv1", "bias_regularizer": null, "kernel_size": [3, 3], "data_format": "channels_last", "strides": [1, 1], "use_bias": true, "activity_regularizer": null, "filters": 64, "padding": "same", "dilation_rate": [1, 1], "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "trainable": true}, "inbound_nodes": [[["block1_pool", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "block2_conv2", "config": {"bias_constraint": null, "kernel_constraint": null, "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "name": "block2_conv2", "bias_regularizer": null, "kernel_size": [3, 3], "data_format": "channels_last", "strides": [1, 1], "use_bias": true, "activity_regularizer": null, "filters": 64, "padding": "same", "dilation_rate": [1, 1], "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "trainable": true}, "inbound_nodes": [[["block2_conv1", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "block2_pool", "config": {"name": "block2_pool", "pool_size": [2, 2], "trainable": true, "data_format": "channels_last", "strides": [2, 2], "padding": "valid"}, "inbound_nodes": [[["block2_conv2", 0, 0, {}]]], "class_name": "MaxPooling2D"}, {"name": "block4_conv1", "config": {"bias_constraint": null, "kernel_constraint": null, "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "name": "block4_conv1", "bias_regularizer": null, "kernel_size": [3, 3], "data_format": "channels_last", "strides": [1, 1], "use_bias": true, "activity_regularizer": null, "filters": 128, "padding": "same", "dilation_rate": [1, 1], "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "trainable": true}, "inbound_nodes": [[["block2_pool", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "block4_conv2", "config": {"bias_constraint": null, "kernel_constraint": null, "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}, "kernel_regularizer": null, "name": "block4_conv2", "bias_regularizer": null, "kernel_size": [3, 3], "data_format": "channels_last", "strides": [1, 1], "use_bias": true, "activity_regularizer": null, "filters": 128, "padding": "same", "dilation_rate": [1, 1], "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "trainable": true}, "inbound_nodes": [[["block4_conv1", 0, 0, {}]]], "class_name": "Conv2D"}, {"name": "block4_pool", "config": {"name": "block4_pool", "pool_size": [2, 2], "trainable": true, "data_format": "channels_last", "strides": [2, 2], "padding": "valid"}, "inbound_nodes": [[["block4_conv2", 0, 0, {}]]], "class_name": "MaxPooling2D"}, {"name": "block5_pool", "config": {"name": "block5_pool", "pool_size": [2, 2], "trainable": true, "data_format": "channels_last", "strides": [1, 1], "padding": "valid"}, "inbound_nodes": [[["block4_pool", 0, 0, {}]]], "class_name": "MaxPooling2D"}, {"name": "flatten_1", "config": {"name": "flatten_1", "trainable": true, "data_format": "channels_last"}, "inbound_nodes": [[["block5_pool", 0, 0, {}]]], "class_name": "Flatten"}, {"name": "dense_4", "config": {"kernel_constraint": null, "activation": "relu", "kernel_regularizer": null, "name": "dense_4", "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "units": 1024, "bias_constraint": null, "trainable": true, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activity_regularizer": null}, "inbound_nodes": [[["flatten_1", 0, 0, {}]]], "class_name": "Dense"}, {"name": "dense_5", "config": {"kernel_constraint": null, "activation": "sigmoid", "kernel_regularizer": null, "name": "dense_5", "bias_regularizer": null, "bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "units": 1, "bias_constraint": null, "trainable": true, "kernel_initializer": {"config": {"scale": 1.0, "seed": null, "mode": "fan_avg", "distribution": "uniform"}, "class_name": "VarianceScaling"}, "activity_regularizer": null}, "inbound_nodes": [[["dense_4", 0, 0, {}]]], "class_name": "Dense"}], "name": "model_2", "output_layers": [["dense_5", 0, 0]], "input_layers": [["input_2", 0, 0]]}, "backend": "tensorflow", "class_name": "Model"}