{"config": {"output_layers": [["dense_5", 0, 0]], "name": "model_2", "layers": [{"config": {"batch_input_shape": [null, 64, 64, 3], "dtype": "float32", "sparse": false, "name": "input_2"}, "class_name": "InputLayer", "name": "input_2", "inbound_nodes": []}, {"config": {"data_format": "channels_last", "padding": "same", "use_bias": true, "bias_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "trainable": true, "dilation_rate": [1, 1], "name": "block1_conv1", "kernel_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "kernel_size": [3, 3], "strides": [1, 1], "filters": 32, "activity_regularizer": null, "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv2D", "name": "block1_conv1", "inbound_nodes": [[["input_2", 0, 0, {}]]]}, {"config": {"data_format": "channels_last", "padding": "same", "use_bias": true, "bias_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "trainable": true, "dilation_rate": [1, 1], "name": "block1_conv2", "kernel_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "kernel_size": [3, 3], "strides": [1, 1], "filters": 32, "activity_regularizer": null, "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv2D", "name": "block1_conv2", "inbound_nodes": [[["block1_conv1", 0, 0, {}]]]}, {"config": {"data_format": "channels_last", "name": "block1_pool", "padding": "valid", "trainable": true, "strides": [2, 2], "pool_size": [2, 2]}, "class_name": "MaxPooling2D", "name": "block1_pool", "inbound_nodes": [[["block1_conv2", 0, 0, {}]]]}, {"config": {"data_format": "channels_last", "padding": "same", "use_bias": true, "bias_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "trainable": true, "dilation_rate": [1, 1], "name": "block2_conv1", "kernel_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "kernel_size": [3, 3], "strides": [1, 1], "filters": 64, "activity_regularizer": null, "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv2D", "name": "block2_conv1", "inbound_nodes": [[["block1_pool", 0, 0, {}]]]}, {"config": {"data_format": "channels_last", "padding": "same", "use_bias": true, "bias_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "trainable": true, "dilation_rate": [1, 1], "name": "block2_conv2", "kernel_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "kernel_size": [3, 3], "strides": [1, 1], "filters": 64, "activity_regularizer": null, "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv2D", "name": "block2_conv2", "inbound_nodes": [[["block2_conv1", 0, 0, {}]]]}, {"config": {"data_format": "channels_last", "name": "block2_pool", "padding": "valid", "trainable": true, "strides": [2, 2], "pool_size": [2, 2]}, "class_name": "MaxPooling2D", "name": "block2_pool", "inbound_nodes": [[["block2_conv2", 0, 0, {}]]]}, {"config": {"data_format": "channels_last", "padding": "same", "use_bias": true, "bias_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "trainable": true, "dilation_rate": [1, 1], "name": "block4_conv1", "kernel_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "kernel_size": [3, 3], "strides": [1, 1], "filters": 128, "activity_regularizer": null, "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv2D", "name": "block4_conv1", "inbound_nodes": [[["block2_pool", 0, 0, {}]]]}, {"config": {"data_format": "channels_last", "padding": "same", "use_bias": true, "bias_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "trainable": true, "dilation_rate": [1, 1], "name": "block4_conv2", "kernel_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "kernel_size": [3, 3], "strides": [1, 1], "filters": 128, "activity_regularizer": null, "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv2D", "name": "block4_conv2", "inbound_nodes": [[["block4_conv1", 0, 0, {}]]]}, {"config": {"data_format": "channels_last", "name": "block4_pool", "padding": "valid", "trainable": true, "strides": [2, 2], "pool_size": [2, 2]}, "class_name": "MaxPooling2D", "name": "block4_pool", "inbound_nodes": [[["block4_conv2", 0, 0, {}]]]}, {"config": {"data_format": "channels_last", "name": "block5_pool", "padding": "valid", "trainable": true, "strides": [1, 1], "pool_size": [2, 2]}, "class_name": "MaxPooling2D", "name": "block5_pool", "inbound_nodes": [[["block4_pool", 0, 0, {}]]]}, {"config": {"trainable": true, "data_format": "channels_last", "name": "flatten_1"}, "class_name": "Flatten", "name": "flatten_1", "inbound_nodes": [[["block5_pool", 0, 0, {}]]]}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "bias_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "units": 1024, "name": "dense_4", "kernel_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "trainable": true, "activity_regularizer": null, "activation": "relu"}, "class_name": "Dense", "name": "dense_4", "inbound_nodes": [[["flatten_1", 0, 0, {}]]]}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "bias_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "units": 1, "name": "dense_5", "kernel_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "trainable": true, "activity_regularizer": null, "activation": "sigmoid"}, "class_name": "Dense", "name": "dense_5", "inbound_nodes": [[["dense_4", 0, 0, {}]]]}], "input_layers": [["input_2", 0, 0]]}, "class_name": "Model", "backend": "tensorflow", "keras_version": "2.2.4"}