{"config": {"output_layers": [["final_block", 0, 0]], "name": "model_1", "layers": [{"config": {"batch_input_shape": [null, 100], "dtype": "float32", "sparse": false, "name": "input_1"}, "class_name": "InputLayer", "name": "input_1", "inbound_nodes": []}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "bias_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "units": 1024, "name": "dense_2", "kernel_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "trainable": true, "activity_regularizer": null, "activation": "relu"}, "class_name": "Dense", "name": "dense_2", "inbound_nodes": [[["input_1", 0, 0, {}]]]}, {"config": {"bias_initializer": {"config": {}, "class_name": "Zeros"}, "use_bias": true, "bias_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "units": 8192, "name": "dense_3", "kernel_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "trainable": true, "activity_regularizer": null, "activation": "relu"}, "class_name": "Dense", "name": "dense_3", "inbound_nodes": [[["dense_2", 0, 0, {}]]]}, {"config": {"target_shape": [8, 8, 128], "trainable": true, "name": "reshape_1"}, "class_name": "Reshape", "name": "reshape_1", "inbound_nodes": [[["dense_3", 0, 0, {}]]]}, {"config": {"beta_initializer": {"config": {}, "class_name": "Zeros"}, "axis": -1, "scale": true, "momentum": 0.99, "gamma_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "name": "batch_normalization_1", "center": true, "beta_constraint": null, "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "beta_regularizer": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null}, "class_name": "BatchNormalization", "name": "batch_normalization_1", "inbound_nodes": [[["reshape_1", 0, 0, {"training": false}]]]}, {"config": {"alpha": 0.10000000149011612, "trainable": true, "name": "leaky_re_lu_1"}, "class_name": "LeakyReLU", "name": "leaky_re_lu_1", "inbound_nodes": [[["batch_normalization_1", 0, 0, {}]]]}, {"config": {"data_format": "channels_last", "padding": "valid", "use_bias": false, "bias_regularizer": null, "output_padding": null, "bias_constraint": null, "kernel_regularizer": null, "trainable": true, "dilation_rate": [1, 1], "name": "conv2d_transpose_1", "kernel_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "kernel_size": [2, 2], "strides": [2, 2], "filters": 256, "activity_regularizer": null, "activation": "linear", "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv2DTranspose", "name": "conv2d_transpose_1", "inbound_nodes": [[["leaky_re_lu_1", 0, 0, {}]]]}, {"config": {"beta_initializer": {"config": {}, "class_name": "Zeros"}, "axis": -1, "scale": true, "momentum": 0.99, "gamma_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "name": "batch_normalization_2", "center": true, "beta_constraint": null, "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "beta_regularizer": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null}, "class_name": "BatchNormalization", "name": "batch_normalization_2", "inbound_nodes": [[["conv2d_transpose_1", 0, 0, {"training": false}]]]}, {"config": {"alpha": 0.10000000149011612, "trainable": true, "name": "leaky_re_lu_2"}, "class_name": "LeakyReLU", "name": "leaky_re_lu_2", "inbound_nodes": [[["batch_normalization_2", 0, 0, {}]]]}, {"config": {"data_format": "channels_last", "padding": "same", "use_bias": true, "bias_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "trainable": true, "dilation_rate": [1, 1], "name": "block_4", "kernel_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "kernel_size": [1, 1], "strides": [1, 1], "filters": 128, "activity_regularizer": null, "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv2D", "name": "block_4", "inbound_nodes": [[["leaky_re_lu_2", 0, 0, {}]]]}, {"config": {"data_format": "channels_last", "padding": "valid", "use_bias": false, "bias_regularizer": null, "output_padding": null, "bias_constraint": null, "kernel_regularizer": null, "trainable": true, "dilation_rate": [1, 1], "name": "conv2d_transpose_2", "kernel_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "kernel_size": [2, 2], "strides": [2, 2], "filters": 128, "activity_regularizer": null, "activation": "linear", "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv2DTranspose", "name": "conv2d_transpose_2", "inbound_nodes": [[["block_4", 0, 0, {}]]]}, {"config": {"beta_initializer": {"config": {}, "class_name": "Zeros"}, "axis": -1, "scale": true, "momentum": 0.99, "gamma_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "name": "batch_normalization_3", "center": true, "beta_constraint": null, "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "beta_regularizer": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null}, "class_name": "BatchNormalization", "name": "batch_normalization_3", "inbound_nodes": [[["conv2d_transpose_2", 0, 0, {"training": false}]]]}, {"config": {"alpha": 0.10000000149011612, "trainable": true, "name": "leaky_re_lu_3"}, "class_name": "LeakyReLU", "name": "leaky_re_lu_3", "inbound_nodes": [[["batch_normalization_3", 0, 0, {}]]]}, {"config": {"data_format": "channels_last", "padding": "same", "use_bias": true, "bias_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "trainable": true, "dilation_rate": [1, 1], "name": "block_5", "kernel_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "kernel_size": [1, 1], "strides": [1, 1], "filters": 64, "activity_regularizer": null, "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv2D", "name": "block_5", "inbound_nodes": [[["leaky_re_lu_3", 0, 0, {}]]]}, {"config": {"data_format": "channels_last", "padding": "valid", "use_bias": false, "bias_regularizer": null, "output_padding": null, "bias_constraint": null, "kernel_regularizer": null, "trainable": true, "dilation_rate": [1, 1], "name": "conv2d_transpose_3", "kernel_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "kernel_size": [2, 2], "strides": [2, 2], "filters": 64, "activity_regularizer": null, "activation": "linear", "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv2DTranspose", "name": "conv2d_transpose_3", "inbound_nodes": [[["block_5", 0, 0, {}]]]}, {"config": {"beta_initializer": {"config": {}, "class_name": "Zeros"}, "axis": -1, "scale": true, "momentum": 0.99, "gamma_regularizer": null, "gamma_initializer": {"config": {}, "class_name": "Ones"}, "name": "batch_normalization_4", "center": true, "beta_constraint": null, "trainable": true, "moving_variance_initializer": {"config": {}, "class_name": "Ones"}, "epsilon": 0.001, "beta_regularizer": null, "moving_mean_initializer": {"config": {}, "class_name": "Zeros"}, "gamma_constraint": null}, "class_name": "BatchNormalization", "name": "batch_normalization_4", "inbound_nodes": [[["conv2d_transpose_3", 0, 0, {"training": false}]]]}, {"config": {"alpha": 0.10000000149011612, "trainable": true, "name": "leaky_re_lu_4"}, "class_name": "LeakyReLU", "name": "leaky_re_lu_4", "inbound_nodes": [[["batch_normalization_4", 0, 0, {}]]]}, {"config": {"data_format": "channels_last", "padding": "same", "use_bias": true, "bias_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "trainable": true, "dilation_rate": [1, 1], "name": "block_6", "kernel_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "kernel_size": [1, 1], "strides": [1, 1], "filters": 32, "activity_regularizer": null, "activation": "relu", "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv2D", "name": "block_6", "inbound_nodes": [[["leaky_re_lu_4", 0, 0, {}]]]}, {"config": {"data_format": "channels_last", "padding": "same", "use_bias": true, "bias_regularizer": null, "bias_constraint": null, "kernel_regularizer": null, "trainable": true, "dilation_rate": [1, 1], "name": "final_block", "kernel_constraint": null, "kernel_initializer": {"config": {"mode": "fan_avg", "distribution": "uniform", "scale": 1.0, "seed": null}, "class_name": "VarianceScaling"}, "kernel_size": [1, 1], "strides": [1, 1], "filters": 3, "activity_regularizer": null, "activation": "sigmoid", "bias_initializer": {"config": {}, "class_name": "Zeros"}}, "class_name": "Conv2D", "name": "final_block", "inbound_nodes": [[["block_6", 0, 0, {}]]]}], "input_layers": [["input_1", 0, 0]]}, "class_name": "Model", "backend": "tensorflow", "keras_version": "2.2.4"}